CREATE TABLE Actors 
(
	ActorId INT IDENTITY NOT NULL PRIMARY KEY,
	MovieId INT NOT NULL FOREIGN KEY REFERENCES Movies(MovieId),
	FirstName VARCHAR(55) NOT NULL,
	LastName VARCHAR(55) NOT NULL,
	BirtDate DATE NOT NULL,
	CountryName VARCHAR(55) NOT NULL
)

INSERT INTO Actors VALUES
(1,'Леонардо','ДиКаприо','11.11.1974', 'CША'),
(1,'Джона','Хилл','20.12.1983', 'CША'),
(1,'Марго','Робби','02.07.1990', 'CША'),
(2,'Джеймс','МакЭвой','21.04.1979', 'Великобритания'),
(3,'Том','Хэнкс','9.07.1956', 'CША'),
(3,'Майкл','Дункан','10.12.1957','CША'),
(4,'Майкл','Кейн','14.03.1933', 'Великобритания'),
(4,'Джессика','Честейн','24.03.1977', 'CША'),
(4,'Мэттью','МакКонахи','4.11.1969', 'CША'),
(4,'Энн ','Хэтэуэй','12.11.1982', 'CША'),
(5,'Элайджа','Вуд','28.01.1981', 'CША'),
(5,'Вигго','Мортенсен','20.10.1958', 'CША'),
(5,'Шон','Эстин','25.02.1971', 'CША'),
(5,'Иэн','Маккеллен','25.05.1939', 'Великобритания'),
(5,'Орландо','Блум','13.01.1977', 'Великобритания'),
(6,'Эдвард','Нортон','18.08.1969', 'CША'),
(6,'Брэд','Питт','18.12.1963', 'CША'),
(7,'Джон','Траволта','18.02.1954', 'CША'),
(7,'Сэмюэл','Джексон','21.12.1948', 'CША'),
(7,'Брюс','Уиллис','19.03.1955', 'CША'),
(7,'Ума','Турман','29.04.1970', 'CША'),
(8,'Майкл','Дж.Фокс','09.06.1961', 'Канада'),
(8,'Кристофер','Ллойд','22.10.1938', 'CША'),
(9,'Мэттью','Бродерик','21.03.1962', 'CША'),
(10,'Дензел','Вашингтон','28.12.1954', 'CША'),
(11,'Зак','Эфрон','18.10.1987', 'CША'),
(12,'Джейсон','Кларк','17.07.1969', 'Австралия'),
(12,'Джож','Бролин','12.02.1968', 'CША'),
(12,'Джейк','Джиленхолл','19.12.1980', 'CША'),
(14,'Арнольд','Шварценеггер','30.07.1947', 'Австрия'),
(15,'Наоми','Уоттс','28.09.1968', 'Великобритания'),
(17,'Брэд','Питт','18.12.1963', 'CША'),
(19,'Леонардо','ДиКаприо','11.11.1974', 'CША'),
(20,'Хью','Джекман','12.11.1968', 'Австралия'),
(20,'Кристиан','Бейл','30.01.1974', 'Великобритания')


SELECT TOP (1000) [ActorId]
      ,[MovieId]
      ,[FirstName]
      ,[LastName]
      ,[BirtDate]
      ,[CountryName]
  FROM [OnlineCinema_DB].[dbo].[Actors]